In [1]:
import coiled
import dask.distributed
import dask.dataframe as dd

In [2]:
cluster = coiled.Cluster(configuration="coiled/default", n_workers=5)

Output()

Found software environment build

In [3]:
client = dask.distributed.Client(cluster)

In [4]:
d2000 = dd.read_parquet("s3://coiled-datasets/timeseries/parquet2000")
d2001 = dd.read_parquet("s3://coiled-datasets/timeseries/parquet2001")
d2002 = dd.read_parquet("s3://coiled-datasets/timeseries/parquet2002")
d2003 = dd.read_parquet("s3://coiled-datasets/timeseries/parquet2003")
d2004 = dd.read_parquet("s3://coiled-datasets/timeseries/parquet2004")

In [5]:
%%time
sorted2000 = d2000.set_index("id").head(10)

CPU times: user 292 ms, sys: 75.5 ms, total: 368 ms
Wall time: 18.5 s

In [6]:
sorted2000

        name         x         y
id
835    Sarah -0.219100 -0.352850
837    Quinn  0.996951 -0.304903
840  Charlie  0.746773 -0.300334
845    Laura  0.432315 -0.079581
845   Yvonne -0.970105  0.626166
847  Norbert  0.678166 -0.327144
847   Ingrid -0.393902 -0.392294
847    Edith  0.817915 -0.424178
847      Tim -0.076271 -0.352444
849   George -0.000690 -0.620664

In [7]:
ddf = dd.concat([d2000, d2001, d2002, d2003, d2004])

In [8]:
ddf.head()

                       id      name         x         y
timestamp
2000-01-01 00:00:00   975       Dan  0.794829  0.396008
2000-01-01 00:00:01  1019  Patricia -0.801709 -0.328839
2000-01-01 00:00:02   989     Zelda -0.825186  0.364211
2000-01-01 00:00:03  1015    Ursula -0.584527  0.396407
2000-01-01 00:00:04  1038   Michael -0.491033  0.518335

In [9]:
%%time
sorted_ddf_id = ddf.set_index("id").head(10)

CPU times: user 725 ms, sys: 74.6 ms, total: 800 ms
Wall time: 55.9 s

In [26]:
sorted_ddf_id

      name         x         y
id
835  Sarah -0.219100 -0.352850
835  Sarah -0.219100 -0.352850
835  Sarah -0.219100 -0.352850
835  Sarah -0.219100 -0.352850
835  Sarah -0.219100 -0.352850
837  Quinn  0.996951 -0.304903
837  Quinn  0.996951 -0.304903
837  Quinn  0.996951 -0.304903
837  Quinn  0.996951 -0.304903
837  Quinn  0.996951 -0.304903